[
  {
    "created_at": "2025-07-02T16:29:29+00:00",
    "username": "HarriettMB@beige.party",
    "content": "<p><span class=\"h-card\" translate=\"no\"><a href=\"https://masto.ai/@Nonilex\" class=\"u-url mention\" rel=\"nofollow noopener\" target=\"_blank\">@<span>Nonilex</span></a></span> The blame for this lies entirely with Trump and Netanyahu. I fear Israel is going to do much worse to Iran in the coming days or weeks, and claim it is doing the destruction to prevent nuclear bomb development. 💔</p>",
    "reblogs": 0,
    "favourites": 2
  },
  {
    "created_at": "2025-07-02T15:38:19+00:00",
    "username": "gorekhaa@anarchism.space",
    "content": "<p>RFK Jr.’s War on Neurodiversity is a War on Individualism<br><a href=\"https://c4ss.org/content/60498\" rel=\"nofollow noopener\" translate=\"no\" target=\"_blank\"><span class=\"invisible\">https://</span><span class=\"\">c4ss.org/content/60498</span><span class=\"invisible\"></span></a></p><p>\"The Trump Administration really seems to have a thing for genocide, and I don’t believe this statement to be hyperbolic even if it is a tad theatrical. Whether they’re launching nationwide dragnets to preserve the racial purity of the endangered American factory, militarizing the Rio Grande, or openly conspiring with Benjamin Netanyahu to hollow out...\"</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T14:24:41.512000+00:00",
    "username": "knoxfeed",
    "content": "<p>Israel Intensifies Mass-Killing Ops in Gaza as Trump and Netanyahu Plot New Demands for Hamas</p><p>Drop Site News / July 02, 2025 at 06:30AM <br />/ source: <a href=\"https://www.youtube.com/watch?v=rT5GkGDkb6Q\" target=\"_blank\" rel=\"nofollow noopener\" translate=\"no\"><span class=\"invisible\">https://www.</span><span class=\"\">youtube.com/watch?v=rT5GkGDkb6Q</span><span class=\"invisible\"></span></a></p><p><a href=\"https://mastodon.social/tags/knoxfeed\" class=\"mention hashtag\" rel=\"tag\">#<span>knoxfeed</span></a> <a href=\"https://mastodon.social/tags/Drop\" class=\"mention hashtag\" rel=\"tag\">#<span>Drop</span></a> Site News</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T14:24:40.963000+00:00",
    "username": "knoxfeed",
    "content": "<p>Gaza Massacres Escalate as Trump and Netanyahu Push Ceasefire Narrative</p><p>Drop Site News / July 02, 2025 at 05:30AM <br />/ source: <a href=\"https://www.youtube.com/watch?v=4XVVIsO1rKQ\" target=\"_blank\" rel=\"nofollow noopener\" translate=\"no\"><span class=\"invisible\">https://www.</span><span class=\"\">youtube.com/watch?v=4XVVIsO1rKQ</span><span class=\"invisible\"></span></a></p><p><a href=\"https://mastodon.social/tags/knoxfeed\" class=\"mention hashtag\" rel=\"tag\">#<span>knoxfeed</span></a> <a href=\"https://mastodon.social/tags/Drop\" class=\"mention hashtag\" rel=\"tag\">#<span>Drop</span></a> Site News</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T13:32:45.869000+00:00",
    "username": "thatsmokepit",
    "content": "<p>President Trump urged Hamas to accept a 60-day ceasefire in Gaza, claiming Israel agreed. As fighting escalates with civilian casualties, Trump discussed the proposal via Qatar and Egypt mediators. Netanyahu will meet Trump amid pressure to end hostilities.</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T13:16:11.318000+00:00",
    "username": "voices4justice.bsky.social@bsky.brid.gy",
    "content": "<p>Between those parties and Netanyahu is Trump, the man who is once again promising to advance regional peace from Gaza to Saudi Arabia. But in the meantime, he's bogged down in a fight with his former friend, billionaire Elon Musk, and in the launch of a new perfume bearing his name.</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T13:14:06.509000+00:00",
    "username": "voices4justice.bsky.social@bsky.brid.gy",
    "content": "<p>But it's reasonable to assume there will be no major changes there prior to the Netanyahu-Trump meeting.\n\nTo a large extent, the army is treading water in Gaza. And even what it's doing is primarily meant to make noise, in the hope of forcing Hamas to compromise.</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T13:12:54.096000+00:00",
    "username": "voices4justice.bsky.social@bsky.brid.gy",
    "content": "<p>Trump and the IDF chief want to end the Gaza war. It's not clear if Netanyahu is on board \nBy <a class=\"mention\" href=\"https://bsky.app/profile/amosharel.bsky.social\" rel=\"nofollow noopener\" target=\"_blank\">@amosharel.bsky.social</a>  🧵<br><br><a href=\"https://www.haaretz.com/israel-news/2025-07-02/ty-article/.premium/trump-and-israels-army-chief-want-to-end-the-gaza-war-its-not-clear-if-bibi-is-on-board/00000197-c79f-da62-a9ff-e7df6c5a0000?utm_source=App_Share&amp;utm_medium=iOS_Native\" rel=\"nofollow noopener\" target=\"_blank\">Trump and the IDF chief want t...</a></p>",
    "reblogs": 1,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T12:38:26.683000+00:00",
    "username": "agitprop_n_absurdity",
    "content": "<p>As Israeli bombings in Gaza intensify, Trump and Netanyahu are publicly claiming a ceasefire deal is near. But Hamas says no new proposals have been made. Jeremy Scahill warns the narrative from Washington and Tel Aviv is misleading.</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T11:17:23.368000+00:00",
    "username": "thefarce.org@bsky.brid.gy",
    "content": "<p>Trump gave them the license to pretend this problem is solve and let Iran speedrun to a nuclear weapon. Better than a hot war, but don't think Netanyahu thinks so.<span class=\"quote-inline\"><br><br>RE: <a href=\"https://bsky.app/profile/did:plc:yxwuluq3ksl4hur6mopcl5el/post/3lsy3kuyeer25\" rel=\"nofollow noopener\" target=\"_blank\">https://bsky.app/profile/did:plc:yxwuluq3ksl4hur6mopcl5el/post/3lsy3kuyeer25</a></span></p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T10:35:38.440000+00:00",
    "username": "todayupdate",
    "content": "<p>Israeli Officials Express Optimism on Gaza Cease-Fire as Netanyahu Prepares to Meet With Trump</p><p>It was still unclear whether the latest U.S.-backed effort can overcome the most entrenched sticking point between Israel and Hamas. Source link</p><p><a href=\"https://todayupdate.site/israeli-officials-express-optimism-on-gaza-cease-fire-as-netanyahu-prepares-to-meet-with-trump/\" target=\"_blank\" rel=\"nofollow noopener\" translate=\"no\"><span class=\"invisible\">https://</span><span class=\"ellipsis\">todayupdate.site/israeli-offic</span><span class=\"invisible\">ials-express-optimism-on-gaza-cease-fire-as-netanyahu-prepares-to-meet-with-trump/</span></a></p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T09:53:26.249000+00:00",
    "username": "LeakLiv",
    "content": "<p>🇮🇷 Mojtaba Fazel, a senior Iranian cleric, has called for severe punishment—including execution or exile—against Donald Trump and Benjamin Netanyahu, citing Quranic law, after they allegedly threatened Iran&#39;s Supreme Leader. He labeled these threats as &quot;waging war against God,&quot; referencing Quranic punishments for such acts.</p><p>&gt;LEAKLIV:/</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T09:52:32.858000+00:00",
    "username": "LeakLiv",
    "content": "<p>🇮🇷 Abdolmajid Kharaqani, a Quranic scholar, recently stated on “Aan” TV that, according to his interpretation of the Quran, not only military leaders but also ordinary people are obligated to confront and even kill leaders of what he called the “front of disbelief.” He controversially suggested that people should raise money to fund the killing of figures like Trump and Netanyahu, framing this as a religious duty for followers of the cleric Makarem Shirazi.</p><p>• Footage: <a href=\"https://fxtwitter.com/leakliv/status/1940346479597715888?s=19\" target=\"_blank\" rel=\"nofollow noopener\" translate=\"no\"><span class=\"invisible\">https://</span><span class=\"ellipsis\">fxtwitter.com/leakliv/status/1</span><span class=\"invisible\">940346479597715888?s=19</span></a></p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T09:35:13.787000+00:00",
    "username": "Buzzbeat",
    "content": "<p>Trump should meet Israeli Prime Minister Benjamin Netanyahu</p><p>NEWYou can now listen to Fox News articles! President Donald Trump is expected to meet Israeli Prime Minister Benjamin Netanyahu on Monday, according to an administration official. Trump also pushes Israel to reach a ceasefire with Gaza and told journalists on Tuesday that a cease-fire was probably next week. &quot;We hope it will happen, and we are looking for this next week,&quot; Trump told journalists on Tuesday. An…</p><p><a href=\"https://www.buzzbeat.site/trump-should-meet-israeli-prime-minister-benjamin-netanyahu/\" target=\"_blank\" rel=\"nofollow noopener\" translate=\"no\"><span class=\"invisible\">https://www.</span><span class=\"ellipsis\">buzzbeat.site/trump-should-mee</span><span class=\"invisible\">t-israeli-prime-minister-benjamin-netanyahu/</span></a></p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T08:38:02+00:00",
    "username": "GiftArticles@tomkahe.com",
    "content": "<p>Trump and the IDF chief want to end the Gaza war. It's not clear if Netanyahu is on board<br><a href=\"https://www.haaretz.com/israel-news/2025-07-02/ty-article/.premium/trump-and-israels-army-chief-want-to-end-the-gaza-war-its-not-clear-if-bibi-is-on-board/00000197-c79f-da62-a9ff-e7df6c5a0000?gift=f4097535ea724dc296511c00580c9e30\" rel=\"nofollow noopener\" translate=\"no\" target=\"_blank\"><span class=\"invisible\">https://www.</span><span class=\"ellipsis\">haaretz.com/israel-news/2025-0</span><span class=\"invisible\">7-02/ty-article/.premium/trump-and-israels-army-chief-want-to-end-the-gaza-war-its-not-clear-if-bibi-is-on-board/00000197-c79f-da62-a9ff-e7df6c5a0000?gift=f4097535ea724dc296511c00580c9e30</span></a></p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T06:36:34.910000+00:00",
    "username": "SteveThompson",
    "content": "<p>&quot;Iran issues fatwa against Trump and Netanyahu&quot; - The Jewish Chronicle  <a href=\"https://www.thejc.com/news/world/iran-issues-fatwa-trump-netanyahu-mrlyg7k3\" target=\"_blank\" rel=\"nofollow noopener\" translate=\"no\"><span class=\"invisible\">https://www.</span><span class=\"ellipsis\">thejc.com/news/world/iran-issu</span><span class=\"invisible\">es-fatwa-trump-netanyahu-mrlyg7k3</span></a></p>",
    "reblogs": 1,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T02:54:00.015000+00:00",
    "username": "todayupdate",
    "content": "<p>Trump Says Israel Agrees to Conditions for Gaza Cease-Fire Proposal</p><p>In a social media post, the president said the United States and Israel were finalizing a proposal to Hamas. The announcement comes ahead of Prime Minister Benjamin Netanyahu’s visit to Washington next week. Source link</p><p><a href=\"https://todayupdate.site/trump-says-israel-agrees-to-conditions-for-gaza-cease-fire-proposal/\" target=\"_blank\" rel=\"nofollow noopener\" translate=\"no\"><span class=\"invisible\">https://</span><span class=\"ellipsis\">todayupdate.site/trump-says-is</span><span class=\"invisible\">rael-agrees-to-conditions-for-gaza-cease-fire-proposal/</span></a></p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-07-02T02:45:44.042000+00:00",
    "username": "charleskeener.bsky.social@bsky.brid.gy",
    "content": "<p>Trump and Netanyahu are openly working to purge the Palestinian territory of Palestinians so the land can be permanently taken from them.</p>",
    "reblogs": 0,
    "favourites": 0
  },
  {
    "created_at": "2025-06-20T10:45:52+00:00",
    "username": "blogfuturomicuba.wordpress.com@blogfuturomicuba.wordpress.com",
    "content": "<p><strong>EEUU: Los tamborileros de la guerra.Financiamientos del lobby sionista en la política de los EE.UU</strong></p><p>En el núcleo de la política estadounidense, el lobby sionista, liderado por el Comité de Asuntos Públicos Estadounidense-Israelí (AIPAC) y financiado por megadonantes, ha convertido a Washington en un escenario donde los tambores de la guerra resuenan al ritmo de los intereses de Israel. Este lobby ha inyectado más de $230 millones para respaldar a Donald Trump desde 2020 y $100 millones en elecciones al Congreso en 2024, asegurando que políticos clave se conviertan en repetidores del discurso sionista, apoyando el genocidio en la Franja de Gaza y agresiones contra Líbano, Siria e Irán. Estos «tamborileros de la guerra» no solo se benefician políticamente de los fondos del lobby, sino que perpetúan un negocio de sangre donde la muerte de civiles palestinos y la escalada de conflictos regionales son el precio de su ascenso al poder. En este sistema, la “democracia” estadounidense simplemente es una fachada para tapar el dinero sionista, y las voces que exigen justicia son silenciadas con millones.</p><p>Miriam Adelson, viuda del magnate de casinos Sheldon Adelson, es la arquitecta principal de esta maquinaria de influencia. Con una fortuna estimada en $29,500 millones en 2025, ha emergido como la mayor donante republicana y una figura central del lobby sionista en EE.UU. A través de su Preserve America PAC, ha canalizado más de $100 millones para la campaña de Trump en 2024, incluyendo pagos de $25 millones mensuales entre julio y septiembre, y $20 millones adicionales a finales de septiembre. Este financiamiento, que eclipsó los $75 millones de Elon Musk, la convirtió en la donante más influyente de la elección, asegurando que Trump y su administración prioricen las políticas de Israel, como la anexión del territorio palestino ocupado y la confrontación con Irán.</p><p>Nacida en Tel Aviv en 1945, Adelson ha declarado que su “corazón está en Israel” y que se siente “atrapada” en EE.UU tras su matrimonio con Sheldon. Su activismo sionista es profundo: es la principal financiadora de Birthright Israel, donando más de $250 millones hasta 2015 para llevar a jóvenes judíos a la nación israelí con el objetivo de que “tengan más bebés judíos” y “hagan lobby en gobiernos” para apoyar a Israel. También ha invertido $25 millones en la escuela de medicina de la Universidad de Ariel, ubicada en un asentamiento ilegal en Cisjordania, y es editora de Israel Hayom, un periódico que promueve la agenda de Benjamin Netanyahu. Su apoyo a los asentamientos la llevó a enfrentar una demanda de $34,000 millones en 2016 por financiar la expansión colonial israelí.</p><p>Adelson no solo financia campañas, sino que moldea la política exterior estadounidense. En 2016, ella y Sheldon donaron $20 millones a la campaña de Trump, condicionando su apoyo a la reubicación de la embajada de EE.UU de Tel Aviv a Jerusalén, un movimiento consumado en 2018 que desató protestas palestinas y consolidó la ocupación. En 2024 presionó por la anexión de Cisjordania, una medida que destruiría cualquier posibilidad de un estado palestino, según su confidente, el rabino Shmuley Boteach. Aunque su portavoz negó que condicionara su apoyo a Trump a esta demanda, su historial sugiere que busca políticas que refuercen la supremacía israelí, incluyendo el genocidio en Gaza, donde más de 50.000 palestinos, principalmente mujeres y niños, han sido asesinados desde octubre de 2023.</p><p>La magnate también lidera el Maccabee Task Force, una organización que combate el movimiento de Boicot, Desinversión y Sanciones (BDS) en universidades estadounidenses, acusándolo de “antisemitismo”. Como presidenta de esta entidad ha dirigido campañas en redes sociales contra estudiantes y universidades que critican a Israel, utilizando tácticas intimidatorias para silenciar el activismo pro-Palestina. Su influencia en la administración Trump asegura que estas políticas de censura se trasladen al ámbito gubernamental, como se ve en las leyes que equiparan críticas a Israel con antisemitismo.</p><p>La influencia de Adelson se refleja en los nombramientos clave de la administración Trump en 2025, en todos ellos que repiten el discurso sionista a cambio de fondos y poder político. Marco Rubio, Secretario de Estado, es un protegido de Adelson, habiendo recibido $1.01 millones de AIPAC y grupos afines desde 2010. En 2015, Trump lo llamó “el títere perfecto” de Sheldon Adelson, pero en 2024 tras los $100 millones de Miriam, Rubio fue nombrado para un cargo que le permite abogar por sanciones contra Irán. Su retórica, que compara el genocidio en Gaza con la lucha contra el nazismo, legitima la masacre de civiles palestinos mientras asegura el flujo de fondos del lobby.</p><p>JD Vance, actual Vicepresidente, es otro beneficiario del lobby sionista. Aunque recibió $167,000 directamente, su mentor, Peter Thiel, aportó $15 millones a su campaña al Senado en 2022. Thiel, cofundador de Palantir Technologies, colabora con el Ministerio de Defensa de Israel en la generación de “listas de objetivos” para el genocidio en Gaza, un negocio lucrativo que vincula a Vance con la maquinaria de guerra sionista. Vance al repetir el discurso de “seguridad nacional” de Israel, se beneficia políticamente al consolidar su posición en la administración, mientras Palantir gana millones con la muerte de palestinos.</p><p>Pete Hegseth, Secretario de Defensa, es un fanático cristiano sionista cuya nominación, aprobada por un margen de 51-50, refleja el poder del lobby para imponer a sus aliados. Hegseth, con un tatuaje de la Cruz de Jerusalén y citas bíblicas que justifican la guerra, rechaza la solución de dos estados y ha exigido que Israel “termine el trabajo” en Gaza. Su apoyo a ataques contra Irán y su silencio ante el genocidio palestino lo convierten en un tamborilero ideal, beneficiándose de la aprobación de donantes como Adelson, quienes ven en él un defensor de la agenda bélica de Israel.<br>Kristi Noem, Secretaria de Seguridad Nacional, ha consolidado su posición al firmar una ley en Dakota del Sur que equipara críticas a Israel con antisemitismo, una medida impulsada por el lobby sionista para censurar el activismo pro-Palestina. Noem, al alinearse con AIPAC, asegura su relevancia política en la administración Trump, beneficiándose de un sistema donde el apoyo a las guerras de Israel garantiza fondos y poder.</p><p>En el Congreso, AIPAC ha invertido $58 millones en el ciclo electoral reciente, según The Guardian, con $25 millones destinados a derrotar progresistas críticos de Israel, como Cori Bush y Jamaal Bowman. Políticos como Glenn Ivey ($7.2 millones), Haley Stevens ($5.4 millones) y Shontel Brown ($4.5 millones) han reemplazado a voces pro-Palestina con repetidores del discurso sionista, apoyando el genocidio en Gaza y la ayuda militar incondicional a Israel. The Intercept revela que AIPAC gastó en el 80% de las 469 carreras al Congreso en 2024, asegurando que el 82% de los congresistas respaldaran a Israel, recibiendo en promedio $125,000, frente a $18,000 para los pro-Palestina. Ted Cruz, senador por Texas, es uno de los mayores beneficiarios, con $1.9 millones en donaciones, incluyendo $562,593 en 2024.</p><p>El lobby sionista, respaldado por ejecutivos de finanzas, seguros y bienes raíces, como Jan Koum, Robert Kraft y Bernie Marcus, no solo promueve las guerras de Israel, sino que bloquea agendas “progresistas” que amenazan sus intereses corporativos, como Build Back Better. In These Times revela que el 60% de los donantes de United Democracy Project (UDP), el Super PAC de AIPAC, son estos ejecutivos vinculados a Trump y al sionismo.</p><p>John Mearsheimer y Stephen Walt, en “The Israel Lobby and US Foreign Policy” argumentan que el lobby sionista ha frustrado cualquier posibilidad de un estado palestino, perpetuando la ocupación. Sin este lobby la postura de EE.UU hacia Palestina sería “fundamentalmente diferente”.</p><p>A pesar del poder del lobby sionista, la resistencia emerge. Progresistas como Rashida Tlaib, la única congresista palestino-estadounidense, y Ilhan Omar enfrentan ataques feroces, con donantes ofreciendo $20 millones para derrotar a Tlaib.</p><p>El equipo (Summer Lee, Jamaal Bowman, Cori Bush, Alexandria Ocasio-Cortez, entre otros) ha sido blanco de $29 millones en primarias, pero victorias como la de Summer Lee en Pensilvania muestran que el dinero no siempre vence. Encuestas indican que el 68% de los estadounidenses apoya un alto el fuego de Israel frente al 17% del Congreso, revelando una desconexión impulsada por el dinero sionista.</p><p>El lobby sionista, ha convertido a los politiqueros de Washington en fervientes tamborileros de la guerra, un lucrativo negocio de sangre donde los fondos del lobby aseguran total lealtad al Estado sionista de Israel mientras esté, masacra pueblos enteros e invade otros en nombre de la providencia divina. “Es un cáncer para la democracia”, dijo el congresista Mark Pocan.</p><p>Tomado del blog Cuba por Siempre</p><p><a rel=\"nofollow noopener\" class=\"hashtag u-tag u-category\" href=\"https://blogfuturomicuba.wordpress.com/tag/iran/\" target=\"_blank\">#Irán</a> <a rel=\"nofollow noopener\" class=\"hashtag u-tag u-category\" href=\"https://blogfuturomicuba.wordpress.com/tag/palestina-libre/\" target=\"_blank\">#PalestinaLibre</a></p>",
    "reblogs": 0,
    "favourites": 0
  }
]